-- MySQL dump 10.13  Distrib 8.0.15, for Win64 (x86_64)
--
-- Host: localhost    Database: dongqiudi
-- ------------------------------------------------------
-- Server version	8.0.15

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `player`
--

DROP TABLE IF EXISTS `player`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `player` (
  `Season` varchar(10) NOT NULL,
  `Name` varchar(20) DEFAULT NULL,
  `Team_Name` varchar(20) NOT NULL,
  `Number` varchar(4) NOT NULL,
  `Position` varchar(8) DEFAULT NULL,
  `Minutes` varchar(5) DEFAULT NULL,
  `PTS` varchar(8) DEFAULT NULL,
  `Assist` varchar(8) DEFAULT NULL,
  `Rebound` varchar(8) DEFAULT NULL,
  `Steal` varchar(8) DEFAULT NULL,
  `Block_Shot` varchar(8) DEFAULT NULL,
  `Turnover` varchar(8) DEFAULT NULL,
  `Foul` varchar(8) DEFAULT NULL,
  `FG` varchar(5) DEFAULT NULL,
  `FT` varchar(5) DEFAULT NULL,
  `TP` varchar(5) DEFAULT NULL,
  PRIMARY KEY (`Season`,`Number`,`Team_Name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `player`
--

LOCK TABLES `player` WRITE;
/*!40000 ALTER TABLE `player` DISABLE KEYS */;
INSERT INTO `player` VALUES ('2019-2020','达米安-利拉德','开拓者','0','后卫','36.7','26.6','7.5','4.2','1','0.4','3','1.9','44.2%','89.7%','34.9%'),('2019-2020','拉塞尔-维斯布鲁克','火箭','0','后卫','35.1','23.9','7.2','8','1.6','0.4','4.4','3.8','43.0%','78.2%','25.2%'),('2019-2020','德文-布克','太阳','1','后卫','35.4','24','6.4','4','0.6','0.3','3.8','3','49.7%','90.8%','38.2%'),('2019-2020','卡德维尔-波普','湖人','1','后卫','23.2','8','1.4','2.2','0.7','0.2','0.8','1.7','44.6%','77.8%','40.0%'),('2019-2020','埃弗里-布拉德利','湖人','11','后卫','27.4','9.6','1.8%','3.2','1','0.1','1.1','2.6','48.8%','75.0%','28.6%'),('2019-2020','特雷-杨','老鹰','11','后卫','35.6','29','8.5','4.4','1.3','0.1','4.7','1.5','44.3%','84.9%','36.6%'),('2019-2020','詹姆斯-哈登','火箭','13','后卫','37.6','38.6','7.4','5.8','1.9','0.7','4.8','3.4','45.1%','87.8%','36.7%'),('2019-2020','丹尼-格林','湖人','14','后卫','25.3','8.6','1.2','3.4','1.3','0.5','1.1','2.5','45.7%','72.7%','41.1%'),('2019-2020','布兰登-英格拉姆','鹈鹕','14','前锋','33.9','25','3.8','7.1','0.9','0.8','2.9','3.1','48.5%','84.4%','38.8%'),('2019-2020','德马库斯-考辛斯','湖人','15','中锋','0','0','0','0','0','0','0','0','0','0','0'),('2019-2020','科怀-莱昂纳德','快船','2','前锋','31.3','25.5','5.1','7.8','1.8','0.6','3.5','1.9','46.1%','87.2%','36.1%'),('2019-2020','安德鲁-维金斯','森林狼','22','前锋','35.5','25','3.1','5.2','0.7','1.2','2.4','2.5','45.5%','74.4%','33.1%'),('2019-2020','勒布朗·詹姆斯','湖人','23','前锋','35.2','25.2','10.8','7.6','1.3','0.6','3.5','1.4','48.9%','70.8%','33.3%'),('2019-2020','布拉德利-比尔','奇才','3','后卫','37.1','28.3','6.8','4.9','1.1','0.3','3.4','2.6','43.8%','83.2%','32.4%'),('2019-2020','安东尼·戴维斯','湖人','3','前锋-中锋','34.9','25.5','3.6','8.8','1.5','3','2.9','2.4','48.2%','87.8%','36%'),('2019-2020','卡尔-安东尼-唐斯','森林狼','32','中锋-前锋','33.9','26.5','4.4','11.7','1','1.3','3.1','3.5','51.4%','79.6%','41.8%'),('2019-2020','托尼斯-阿德托昆博','雄鹿','34','前锋','31.1','31','5.6','12.9','1.3','1.2','3.7','3.1','56.6%','59.8%','34.2%'),('2019-2020','阿列克斯-卡鲁索','湖人','4','后卫','19.9','4.7','2.1','1.7','1.1','0.4','1.1','1.4','40.0%','60.0%','27.0%'),('2019-2020','帕斯卡尔-西亚卡姆','猛龙','43','前锋','36.6','25.1','3.6','8','1','1','2.7','2.9','45.7%','81.3%','39.2'),('2019-2020','多诺万-米切尔','爵士','45','后卫','34.9','24.8','4','4.6','1.2','0.3','2.5','2.4','44.9%','83.9%','34.6%'),('2019-2020','贾维尔-麦基','湖人','7','中锋-前锋','16.9','7.3','0.8','6.2','0.6','1.2','0.9','2.1','62.2%','64.0%','0'),('2019-2020','东契奇','独行侠','77','前锋-后卫','32.2','29.3','8.9','9.6','1.2','0.1','4.4','2.3','48.1%','80.3%','32.6%'),('2019-2020','扎克-拉文','公牛','8','后卫-前锋','33.4','23.6','3.8','4.6','1.3','0.4','3.4','2.4','43.1%','82.9','39.5%');
/*!40000 ALTER TABLE `player` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `schedule`
--

DROP TABLE IF EXISTS `schedule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `schedule` (
  `Date_Time` varchar(20) NOT NULL,
  `Team_Name` varchar(20) NOT NULL,
  `Opponent` varchar(20) DEFAULT NULL,
  `Result` varchar(5) DEFAULT NULL,
  `Scores` varchar(10) DEFAULT NULL,
  `Site` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`Date_Time`,`Team_Name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schedule`
--

LOCK TABLES `schedule` WRITE;
/*!40000 ALTER TABLE `schedule` DISABLE KEYS */;
INSERT INTO `schedule` VALUES ('2019-11-18 10:30','湖人','老鹰','湖人胜','122:101','斯台普斯中心'),('2019-11-20 11:30','湖人','雷霆','湖人胜','122:107','斯台普斯中心'),('2019-11-23 11:30','雷霆','湖人','湖人胜','127:130','切萨皮克能源球场'),('2019-11-24 9:00','灰熊','湖人','湖人胜','108:109','联邦快递球馆'),('2019-12-10 10:00','太阳','森林狼','太阳胜','125:109','托金斯迪克度假酒店球馆'),('2019-12-10 10:00','爵士','雷霆','雷霆胜','90:104','威英特智能家居球馆'),('2019-12-10 11:30','勇士','灰熊','灰熊胜','102:110','大通中心'),('2019-12-10 8:00','步行者','快船','快船胜','99:110','班克斯人寿球馆'),('2019-12-10 8:30','凯尔特人','骑士','凯尔特人胜','110:88','TD北岸花园球馆'),('2019-12-10 9:00','公牛','猛龙','猛龙胜','92:93','联合中心球馆'),('2019-12-10 9:00','雄鹿','魔术','雄鹿胜','110:101','费哲球馆'),('2019-12-10 9:00','鹈鹕','活塞','活塞胜','103:105','冰沙王中心'),('2019-12-11 11:00','开拓者','尼克斯','开拓者胜','115:87','摩达中心'),('2019-12-11 8:00','黄蜂','奇才','黄蜂胜','114:107','光谱中心'),('2019-12-11 9:00','76人','掘金','76人胜','97:92','富国银行中心'),('2019-12-11 9:00','热火','老鹰','热火胜','135:121','美航球馆'),('2019-12-12 10:00','太阳','灰熊','灰熊胜','108:115','托金斯迪克度假酒店球馆'),('2019-12-12 10:30','雄鹿','鹈鹕','雄鹿胜','127:112','费哲球馆'),('2019-12-12 11:00','国王','雷霆','国王胜','94:93','黄金一号中心'),('2019-12-12 11:30','勇士','尼克斯','尼克斯胜','122:124','大通中心'),('2019-12-12 8:00','步行者','凯尔特人','步行者胜','122:117','班克斯人寿球馆'),('2019-12-12 8:00','猛龙','快船','快船胜','92:112','丰业银行球馆'),('2019-12-12 8:00','魔术','湖人','湖人胜','87:96','安利球馆'),('2019-12-12 8:30','篮网','黄蜂','黄蜂胜','108:113','巴克莱中心'),('2019-12-12 9:00','公牛','老鹰','公牛胜','136:102','联合中心球馆'),('2019-12-12 9:00','森林狼','爵士','爵士胜','116:127','明尼苏达州明尼阿波利斯'),('2019-12-13 10:00','活塞','独行侠','独行侠胜','111:122','小凯撒球馆'),('2019-12-13 11:30','掘金','开拓者','掘金胜','114:99','百事中心'),('2019-12-13 9:00','凯尔特人','76人','76人胜','109:115','TD北岸花园球馆'),('2019-12-13 9:30','马刺','骑士','骑士胜','109:117','AT&T中心'),('2019-12-14 10:00','灰熊','雄鹿','雄鹿胜','114:127','联邦快递球馆'),('2019-12-14 10:30','森林狼','快船','快船胜','117:124','明尼苏达州明尼阿波利斯'),('2019-12-14 11:00','国王','尼克斯','尼克斯胜','101:103','黄金一号中心'),('2019-12-14 8:00','76人','鹈鹕','76人胜','116:109','富国银行中心'),('2019-12-14 8:00','热火','湖人','湖人胜','110:113','美航球馆'),('2019-12-14 8:30','老鹰','步行者','步行者胜','100:110','国家农业球馆'),('2019-12-14 9:00','公牛','黄蜂','黄蜂胜','73:83','联合中心球馆'),('2019-12-15 10:00','掘金','雷霆','掘金胜','110:102','百事中心'),('2019-12-15 6:00','太阳','马刺','马刺胜','119:121','托金斯迪克度假酒店球馆'),('2019-12-15 8:30','猛龙','篮网','猛龙胜','110:102','丰业银行球馆'),('2019-12-15 9:00','公牛','快船','公牛胜','109:106','联合中心球馆'),('2019-12-15 9:00','灰熊','奇才','灰熊胜','128:111','联邦快递球馆'),('2019-12-15 9:30','独行侠','热火','热火胜','118:122','美航中心'),('2019-12-16 4:30','鹈鹕','魔术','魔术胜','119:130','冰沙王中心'),('2019-12-16 6:00','步行者','黄蜂','步行者胜','107:85','班克斯人寿球馆'),('2019-12-16 7:00','篮网','76人','篮网胜','109:89','巴克莱中心'),('2019-12-16 7:00','老鹰','湖人','湖人胜','96:101','国家农业球馆'),('2019-12-16 9:00','掘金','尼克斯','掘金胜','111:105','百事中心'),('2019-12-16 9:30','勇士','国王','国王胜','79:100','大通中心'),('2019-12-17 10:00','太阳','开拓者','开拓者胜','110:111','托金斯迪克度假酒店球馆'),('2019-12-17 8：00','活塞','奇才','奇才胜','119:133','小凯撒球馆'),('2019-12-17 8:30','猛龙','骑士','猛龙胜','133:113','丰业银行球馆'),('2019-12-17 9:00','灰熊','热火','灰熊胜','118:111','联邦快递球馆'),('2019-12-17 9:00','雄鹿','独行侠','独行侠胜','116:120','费哲球馆'),('2019-12-17 9:00','雷霆','公牛','雷霆胜','109:106','切萨皮克能源球场'),('2019-12-18 10:00','爵士','魔术','爵士胜','109:102','威英特智能家居球馆'),('2019-12-18 11:30','快船','太阳','快船胜','120:99','斯台普斯中心'),('2019-12-18 8:00','步行者','湖人','步行者胜','105:102','班克斯人寿球馆'),('2019-12-18 8:00','黄蜂','国王','黄蜂胜','102:110','光谱中心'),('2019-12-18 9:00','鹈鹕','篮网','篮网胜','101:108','冰沙王中心'),('209-12-18 8:30','尼克斯','老鹰','尼克斯胜','143:120','麦迪逊广场花园球馆');
/*!40000 ALTER TABLE `schedule` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `team`
--

DROP TABLE IF EXISTS `team`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `team` (
  `Team_Name` varchar(20) NOT NULL,
  `Zone` varchar(4) DEFAULT NULL,
  `Coach` varchar(20) DEFAULT NULL,
  `Arena` varchar(20) DEFAULT NULL,
  `PPG` varchar(10) DEFAULT NULL,
  `APG` varchar(10) DEFAULT NULL,
  `RPG` varchar(10) DEFAULT NULL,
  `SPG` varchar(10) DEFAULT NULL,
  `BPG` varchar(10) DEFAULT NULL,
  `AFG` varchar(5) DEFAULT NULL,
  `AFT` varchar(5) DEFAULT NULL,
  `ATP` varchar(5) DEFAULT NULL,
  `WINS` int(15) DEFAULT NULL,
  PRIMARY KEY (`Team_Name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `team`
--

LOCK TABLES `team` WRITE;
/*!40000 ALTER TABLE `team` DISABLE KEYS */;
INSERT INTO `team` VALUES ('奇才','东南分区','斯科特-布鲁克斯','第一资本球馆','118','28.1','41.1','7.4','3.9','47.3%','81.0%','37.6%',8),('尼克斯','大西洋','大卫-菲兹戴尔','麦迪逊广场花园球馆','101.2','20.1','45.3','7.8','4.6','42.4%','67.9%','34.4%',7),('湖人','太平洋','弗兰克·沃格尔','斯台普斯中心','111.9','26.5','45.5','8.5','7.6','47.9%','74.9%','35.5%',14),('灰熊','西南分区','泰勒-詹金斯','联邦快递球馆','108.9','26.9','45.3','7.9','5.3','45.9%','76.5%','34.9%',5),('热火','东南分区','埃里克-斯波尔斯特拉','美航球馆','112.2','25.2','44.7','8.4','4.5','47.2%','76.6%','38.2%',19),('猛龙','大西洋','尼克-纳斯','丰业银行球馆','111.7','25.2','46.3','8.5','5.4','45.1%','80.4%','37.8%',18),('篮网','大西洋','肯尼-阿特金森','巴克莱中心','111.9','24.2','48','6.9','4.9','44.9%','74.1%','34.3%',15),('老鹰','东南分区','劳埃德-皮尔斯','国家农业球馆','107.8','23.7','42.3','9.2','5.1','45.5%','73.3%','31.2%',4),('雄鹿','中央分区','迈克·布登霍尔泽','费哲球馆','119.8','24.6','51.9','7.8','6.3','47.5%','71.6%','34.3',13),('雷霆','西北分区','多诺万','切萨皮克能源球场','107.1','21.7','42.7','9.2','4.2','45.9%','79.2%','35.7%',5),('魔术','东南分区','史蒂夫-克利福德','安利球馆','103.5','22.7','44.8','8.1','6.5','43.4%','78.0%','34.0%',12),('黄蜂','东南分区','詹姆斯-博雷格','光谱中心','104.5','23.6','43.2','6.6','4.4','43.6%','74.7%','35.9%',13);
/*!40000 ALTER TABLE `team` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `User_Id` int(20) NOT NULL,
  `User_Name` varchar(20) NOT NULL,
  `User_Password` varchar(20) NOT NULL,
  `User_Email` varchar(20) NOT NULL,
  `Telephone_Number` int(20) NOT NULL,
  PRIMARY KEY (`User_Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'1','1','1',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-01-11 10:27:51
